# 1
a = 6
b = 2
c = 0
if b < a:
    c = a * b
print(c)

# **********************************
# 2
bank = int(input("Сколько денег на счету? "))
if bank >= 75000:
    bank -= 75000
    print("Покупка совершена")
    print("остаток кэша", bank)
else:
    print("Недостаточно кэша")
print("хорошего дня")

# ***********************************
# 3
father = 5
son = int(input("Введи число: "))
if father == son:
    print("Угадал, иди гулять")
else:
    print("не угадал, учи уроки")
print("конец игры")

